from __future__ import annotations

import re
import unicodedata


def normalize_string(s):
    if not isinstance(s, str):
        return s
    s = s.lower()
    s = unicodedata.normalize("NFD", s)
    s = "".join(c for c in s if unicodedata.category(c) != "Mn")
    s = " ".join(s.split())
    return s


def normalizeMunicipality(term):
    _TODELETE = ["ΔΗΜΟΣ", "Δήμος", "Δ.", ":"]
    for i in _TODELETE:
        term = normalize_string(term).replace(normalize_string(i), "")
    replacements_raw = {
        "ΝΙΚΑΙΑΣ - ΑΓΙΟΥ Ι. ΡΕΝΤΗ": "ΝΙΚΑΙΑΣ - ΑΓΙΟΥ ΙΩΑΝΝΗ ΡΕΝΤΗ",
        "ΛΙΒΑΔΕΙΑΣ": "ΛΕΒΑΔΕΩΝ",
        "ΚΑΡΔΑΜΥΛΩΝ": "ΧΙΟΥ",
        "ΦΙΛΛΙΠΙΑΔΑΣ": "ΖΗΡΟΥ",
        "ΑΡΤΑΣ": "ΑΡΤΑΙΩΝ",
        "ΑΙΤΩΛΙΚΟΥ": "ΙΕΡΑΣ ΠΟΛΗΣ ΜΕΣΟΛΟΓΓΙΟΥ",
        "ΠΕΙΡΑΙΑ": "ΠΕΙΡΑΙΩΣ",
        "ΑΣΤΡΟΥΣ": "ΒΟΡΕΙΑΣ ΚΥΝΟΥΡΙΑΣ",
        "ΝΕΥΡΟΚΟΠΙΟΥ": "ΚΑΤΩ ΝΕΥΡΟΚΟΠΙΟΥ",
        "ΝΑΥΠΛΙΟΥ": "ΝΑΥΠΛΙΕΩΝ",
        "ΘΗΒΑΣ": "ΘΗΒΑΙΩΝ",
        "ΛΕΧΑΙΝΩΝ": "ΑΝΔΡΑΒΙΔΑΣ - ΚΥΛΛΗΝΗΣ",
        "ΖΑΚΥΝΘΙΩΝ": "ΖΑΚΥΝΘΟΥ",
        "ΕΛΑΤΙΩΝ": "ΑΜΦΙΚΛΕΙΑΣ - ΕΛΑΤΕΙΑΣ",
        "ΙΤΕΑΣ": "ΔΕΛΦΩΝ",
        "ΑΡΕΟΠΟΛΕΩΣ": "ΑΝΑΤΟΛΙΚΗΣ ΜΑΝΗΣ",
        "ΛΑΥΡΙΟΥ": "ΛΑΥΡΕΩΤΙΚΗΣ",
        "ΔΕΛΒΙΝΑΚΙΟΥ": "ΠΩΓΩΝΙΟΥ",
        "ΚΗΡΥΚΟΥ": "ΙΚΑΡΙΑΣ",
        "ΝΑΥΠΑΚΤΟΥ": "ΝΑΥΠΑΚΤΙΑΣ",
        "ΑΡΓΟΥΣ": "ΑΡΓΟΥΣ - ΜΥΚΗΝΩΝ",
        "ΜΩΛΟΥ - ΑΓ. ΚΩΝΣΤΑΝΤΙΝΟΥ": "ΚΑΜΕΝΩΝ ΒΟΥΡΛΩΝ",
        "ΚΟΡΙΝΘΟΥ": "ΚΟΡΙΝΘΙΩΝ",
        "ΛΟΥΤΡΑΚΙΟΥ - ΑΓ. ΘΕΟΔΩΡΩΝ": "ΛΟΥΤΡΑΚΙΟΥ - ΠΕΡΑΧΩΡΑΣ - ΑΓΙΩΝ ΘΕΟΔΩΡΩΝ",
        "ΣΤΑΓΥΡΩΝ - ΑΚΑΝΘΟΥ": "ΑΡΙΣΤΟΤΕΛΗ",
        "ΔΕΣΦΙΝΗΣ": "ΔΕΛΦΩΝ",
        "ΚΑΛΛΟΝΗΣ": "ΔΥΤΙΚΗΣ ΛΕΣΒΟΥ",
        "ΓΑΡΓΑΛΙΑΝΩΝ": "ΤΡΙΦΥΛΙΑΣ",
        "ΑΘΩΣ": "ΟΡΟΥΣ",
        "ΒΑΘΕΟΣ": "ΣΑΜΟΥ",
        "ΕΥΡΩΣΤΙΝΗΣ": "ΞΥΛΟΚΑΣΤΡΟΥ - ΕΥΡΩΣΤΙΝΗΣ",
        "ΕΛΕΥΘΕΡΟΥΠΟΛΗΣ": "ΠΑΓΓΑΙΟΥ",
        "ΧΡΥΣΟΥΠΟΛΗΣ": "ΝΕΣΤΟΥ",
        "ΚΡΑΝΙΔΙΟΥ": "ΕΡΜΙΟΝΙΔΑΣ",
        "ΛΑΡΙΣΑΣ": "ΛΑΡΙΣΑΙΩΝ",
        "ΕΠΤΑΧΩΡΙΟΥ": "ΒΟΙΟΥ",
        "ΒΡΥΣΣΩΝ": "ΑΠΟΚΟΡΩΝΟΥ",
        "ΔΙΚΑΙΩΝ": "ΟΡΕΣΤΙΑΔΑΣ",
        "ΘΕΣΠΡΩΤΙΚΟΥ": "ΖΗΡΟΥ",
        "ΜΕΤΑΜΟΡΦΩΣΕΩΣ": "ΜΕΤΑΜΟΡΦΩΣΗΣ",
        "ΑΚΤΙΟΥ ΒΟΝΙΤΣΑΣ": "ΑΚΤΙΟΥ - ΒΟΝΙΤΣΑΣ",
        "ΑΡΓΟΣ ΟΡΕΣΤΙΚΟΥ": "ΑΡΓΟΥΣ - ΟΡΕΣΤΙΚΟΥ",
        "ΑΡΓΟΥΣ ΟΡΕΣΤΙΚΟΥ": "ΑΡΓΟΥΣ - ΟΡΕΣΤΙΚΟΥ",
        "ΠΕΤΡΟΥΠΟΛΕΩΣ": "ΠΕΤΡΟΥΠΟΛΗΣ",
        "ΛΕΥΚΑΔΟΣ": "ΛΕΥΚΑΔΑΣ",
        "ΛΟΥΤΡΑΚΙΟΥ": "ΔΗΜΟΣ ΛΟΥΤΡΑΚΙΟΥ - ΠΕΡΑΧΩΡΑΣ - ΑΓΙΩΝ ΘΕΟΔΩΡΩΝ",
    }
    replacements = {normalize_string(k): v for k, v in replacements_raw.items()}

    term = re.sub(r"\s*-\s*", " - ", term)
    term = term.replace("(", "").replace(")", "")
    term = replacements.get(term, term)
    return term.upper().strip()
